app/controllers/posts_controller.rb

SELECT * FROM `posts`
---
  def index
    @posts = Post.paginate :page => params[:page], :order => 'created_at DESC'